#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

typedef struct person {
    char name[40];
    char phone[40];
    char address[100];
}person;

typedef struct professor {
    person p;
    char major[40];
    char class[10][40];
}professor;

typedef struct student {
    person p;
    int id;
    float grade;
    char major[40];
    char job[40];
    professor prof;
}student;

professor p[5] = {
        {{"김이일","010-0000-0001","서울시 구로구 고척동 1"},"전산과",{"객체지향","분석설계"}},
        {{"김이이","010-0000-0002","서울시 구로구 고척동 2"},"전산과",{"분석설계"}},
        {{"김이삼","010-0000-0003","서울시 구로구 고척동 3"},"전산과",{"객체지향","자료구조"}},
        {{"김이사","010-0000-0004","서울시 구로구 고척동 4"},"교양과",{"객체지향","이산수학"}},
        {{"김이오","010-0000-0005","서울시 구로구 고척동 5"},"교양과",{"이산수학","자료구조"}}
};

int main() {
    student s[10] = {
        {{"강이일","010-1111-0001","서울시 도곡동"},1,4.3,"전자상거래","공무원",p[0]},
        {{"강이이","010-1111-0002","서울시 도곡동"},2,4.2,"컴퓨터공학","군 인",p[1]},
        {{"강이삼","010-1111-0003","서울시 도곡동"},3,4.1,"전자공학부","프로그래머",p[2]},
        {{"강이사","010-1111-0004","서울시 도곡동"},4,4.0,"전자공학부","웹마스터",p[3]},
        {{"강이오","010-1111-0005","서울시 도곡동"},5,3.9,"컴퓨터공학","프로그래머",p[4]},
        {{"강이육","010-1111-0006","서울시 도곡동"},6,3.8,"컴퓨터공학","프로그래머",p[0]},
        {{"강이칠","010-1111-0007","서울시 도곡동"},7,3.7,"컴퓨터공학","웹마스터",p[1]},
        {{"강이팔","010-1111-0008","서울시 도곡동"},8,3.6,"전자상거래","프로그래머",p[2]},
        {{"강이구","010-1111-0009","서울시 도곡동"},9,3.5,"전자상거래","프로그래머",p[3]},
        {{"강이십","010-1111-0010","서울시 도곡동"},10,3.4,"전자상거래","DB관리자",p[4]}
    };


    printf("%3s   %7s      %5s   %10s   %10s   %10s\n\n", "이 름", "전 화 번 호", "주 소", "학 과", "진로", "담당 교수");
    for (int i = 0; i < 10; i++) {
        printf("%3s %10s %10s %10s %10s %10s\n", s[i].p.name, s[i].p.phone, s[i].p.address, s[i].major, s[i].job, s[i].prof.p.name);
    }



}